[
  {
    "id": 1,
    "title": "Why React 19 Will Change Everything",
    "content": "React 19 introduces major updates that simplify server components and suspense. In this post, we’ll explore what these changes mean for both beginners and advanced devs. The Server Actions API is a huge deal, enabling you to write backend logic inline with UI components. That, combined with enhanced streaming and partial hydration, is setting a new benchmark.",
    "author": "ashutosh",
    "points": 123,
    "comments_count": 12,
    "createdAt": "2025-05-10T08:00:00Z"
  },
  {
    "id": 2,
    "title": "The Cleanest Way to Structure a Full Stack App",
    "content": "Let’s talk folders, service layers, types, and everything in between. Full stack apps can easily get messy. The cleanest structure I’ve found involves separating your app into core, domain, and feature modules. Alongside, use tools like Zod for validation, Prisma for DB access, and tRPC or REST for API access. Codegen and layered architecture help massively here.",
    "author": "devdude",
    "points": 98,
    "comments_count": 8,
    "createdAt": "2025-05-10T09:15:00Z"
  },
  {
    "id": 3,
    "title": "Proof of Work vs Proof of Stake: Beginner Friendly Breakdown",
    "content": "This guide simplifies the two most important consensus mechanisms. Proof of Work relies on computational power to mine blocks — think Bitcoin. Proof of Stake, on the other hand, uses economic staking to secure the network — think Ethereum post-merge. We’ll explore real-world analogies, security trade-offs, and future trends in consensus design.",
    "author": "chainqueen",
    "points": 211,
    "comments_count": 34,
    "createdAt": "2025-05-09T20:00:00Z"
  },
  {
    "id": 4,
    "title": "Debugging with AI: A Complete Workflow",
    "content": "Using GitHub Copilot, ChatGPT, and Cursor to squash bugs efficiently is the new standard. This post walks through how to isolate problems, generate suggestions, and even write tests using AI tools. You'll be surprised how much faster you debug with this workflow.",
    "author": "bughunter",
    "points": 42,
    "comments_count": 3,
    "createdAt": "2025-05-08T17:30:00Z"
  },
  {
    "id": 5,
    "title": "Monorepo Magic with Turbo, PNPM, and NX",
    "content": "Tired of messy codebases? Learn how monorepos using Turborepo, PNPM workspaces, and NX help scale large apps. We'll explore dependency graphing, caching, and how to maintain blazing fast CI/CD.",
    "author": "monomaster",
    "points": 154,
    "comments_count": 17,
    "createdAt": "2025-05-09T12:00:00Z"
  },
  {
    "id": 6,
    "title": "How to Build Your Own DevBuzz in 3 Days",
    "content": "Inspired by Hacker News, this post outlines how to bootstrap a clone from scratch using Next.js, Prisma, shadcn/ui, and custom auth. Includes structure, routing, styling, and deployment tips.",
    "author": "ashutosh",
    "points": 185,
    "comments_count": 21,
    "createdAt": "2025-05-08T08:45:00Z"
  },
  {
    "id": 7,
    "title": "Top 10 TypeScript Tips for 2025",
    "content": "Here are the most useful tricks every TypeScript developer should know — from conditional types to template literal types, and real-world use of `satisfies` and `infer`. These will level up your DX immediately.",
    "author": "tsguru",
    "points": 312,
    "comments_count": 40,
    "createdAt": "2025-05-07T10:00:00Z"
  },
  {
    "id": 8,
    "title": "Tailwind CSS v4 — What’s New?",
    "content": "Tailwind 4.0 brings design tokens, CSS variables, improved dark mode support, and faster build times. This post goes over all the changes and how to migrate your existing project.",
    "author": "csswizard",
    "points": 66,
    "comments_count": 9,
    "createdAt": "2025-05-10T04:30:00Z"
  },
  {
    "id": 9,
    "title": "A Step-by-Step Guide to Prisma + PostgreSQL",
    "content": "Learn how to set up a production-ready PostgreSQL database with Prisma, including schema design, relationships, migrations, and seed data. Great for new full-stack devs.",
    "author": "dbdoc",
    "points": 77,
    "comments_count": 5,
    "createdAt": "2025-05-06T13:45:00Z"
  },
  {
    "id": 10,
    "title": "Mastering React Server Components",
    "content": "Server components are the future of React. This post covers the why, when, and how of RSCs, including loading patterns, suspense boundaries, and working with server-only logic.",
    "author": "reactpro",
    "points": 88,
    "comments_count": 11,
    "createdAt": "2025-05-05T16:10:00Z"
  },
  {
    "id": 11,
    "title": "Unlocking the Power of Zod for Runtime Safety",
    "content": "Zod lets you enforce validation at runtime with TypeScript. This guide walks you through real-world schemas, error handling, and combining with React forms.",
    "author": "typehero",
    "points": 109,
    "comments_count": 10,
    "createdAt": "2025-05-04T10:30:00Z"
  },
  {
    "id": 12,
    "title": "The Case for Vanilla JavaScript in 2025",
    "content": "Frameworks are great, but sometimes native JavaScript is the simplest, cleanest tool. This post makes a strong case with examples for ditching React in small projects.",
    "author": "nostalgicdev",
    "points": 45,
    "comments_count": 2,
    "createdAt": "2025-05-04T09:10:00Z"
  },
  {
    "id": 13,
    "title": "How to Deploy a Next.js App in 2 Minutes",
    "content": "Need a quick deployment pipeline? This guide walks you through deploying a Next.js app to Vercel with env vars, preview branches, and CI/CD in 2 minutes flat.",
    "author": "fastdeploy",
    "points": 140,
    "comments_count": 7,
    "createdAt": "2025-05-03T15:00:00Z"
  },
  {
    "id": 14,
    "title": "Rate Limiting Your API the Right Way",
    "content": "Protect your app from abuse by learning how to add IP-based and token-based rate limiting using libraries like `express-rate-limit`, Redis, and middleware guards.",
    "author": "secureapi",
    "points": 95,
    "comments_count": 4,
    "createdAt": "2025-05-03T08:45:00Z"
  },
  {
    "id": 15,
    "title": "An Intro to shadcn/ui",
    "content": "This post introduces the shadcn/ui component system — how it's different from component libraries, how to install and customize, and why it blends so well with Tailwind.",
    "author": "uimaster",
    "points": 81,
    "comments_count": 6,
    "createdAt": "2025-05-02T14:00:00Z"
  },
  {
    "id": 16,
    "title": "Understanding Server Actions in Next.js 15",
    "content": "Next.js 15 introduces server actions. Learn how to use them for mutation logic, type-safe form handling, and how they replace API routes in many cases.",
    "author": "nextnerd",
    "points": 100,
    "comments_count": 8,
    "createdAt": "2025-05-02T10:00:00Z"
  },
  {
    "id": 17,
    "title": "How Cursor Made Me 5x Faster at Debugging",
    "content": "Cursor.dev is an AI coding editor built on VS Code. Here's how it changed my workflow for the better — from autocomplete to debugging entire files with one prompt.",
    "author": "aipilot",
    "points": 133,
    "comments_count": 15,
    "createdAt": "2025-05-01T17:45:00Z"
  },
  {
    "id": 18,
    "title": "AI Prompt Engineering for Developers",
    "content": "Prompt engineering is a skill every dev should master in 2025. Learn how to write effective prompts, chain requests, and build prompt-based tools inside your apps.",
    "author": "prompter",
    "points": 147,
    "comments_count": 18,
    "createdAt": "2025-05-01T08:30:00Z"
  },
  {
    "id": 19,
    "title": "The Hidden Cost of Over-Engineering",
    "content": "Too many abstractions can kill productivity. This post outlines examples of over-engineered systems and how to identify unnecessary complexity in your stack.",
    "author": "simplicityfirst",
    "points": 51,
    "comments_count": 4,
    "createdAt": "2025-04-30T18:00:00Z"
  },
  {
    "id": 20,
    "title": "Web3 UX Sucks — Here's How We Can Fix It",
    "content": "Let’s face it — Web3 onboarding and wallets are painful. Here are 5 product and developer solutions to improve UX in dApps, from gasless flows to session keys.",
    "author": "onchainuser",
    "points": 72,
    "comments_count": 6,
    "createdAt": "2025-04-30T11:00:00Z"
  }
]
